----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 8, 257, 109]              80
              ReLU-2          [-1, 8, 257, 109]               0
            Conv2d-3         [-1, 16, 257, 109]           1,168
              ReLU-4         [-1, 16, 257, 109]               0
         MaxPool2d-5          [-1, 16, 128, 54]               0
            Conv2d-6          [-1, 32, 128, 54]           4,640
              ReLU-7          [-1, 32, 128, 54]               0
            Conv2d-8          [-1, 32, 128, 54]           9,248
              ReLU-9          [-1, 32, 128, 54]               0
        MaxPool2d-10           [-1, 32, 64, 27]               0
           Conv2d-11           [-1, 64, 64, 27]          18,496
             ReLU-12           [-1, 64, 64, 27]               0
           Conv2d-13           [-1, 64, 64, 27]          36,928
             ReLU-14           [-1, 64, 64, 27]               0
        MaxPool2d-15           [-1, 64, 32, 13]               0
          Flatten-16                [-1, 26624]               0
           Linear-17                 [-1, 8196]     218,218,500
             ReLU-18                 [-1, 8196]               0
           Linear-19                 [-1, 1024]       8,393,728
             ReLU-20                 [-1, 1024]               0
           Linear-21                  [-1, 512]         524,800
             ReLU-22                  [-1, 512]               0
           Linear-23                   [-1, 16]           8,208
================================================================
Total params: 227,215,796
Trainable params: 227,215,796
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 22.20
Params size (MB): 866.76
Estimated Total Size (MB): 889.07
----------------------------------------------------------------